----------------------------Session #1-----------------------------------
BEGIN;
-- BEGIN
----------------------------Session #2-----------------------------------
BEGIN;
-- BEGIN

----------------------------Session #1-----------------------------------
UPDATE pizzeria SET rating = 1 WHERE id = 1;
-- UPDATE 1

----------------------------Session #2-----------------------------------
UPDATE pizzeria SET rating = 2 WHERE id = 2;
-- UPDATE 1

----------------------------Session #1-----------------------------------
UPDATE pizzeria SET rating = 3 WHERE id = 2;
--UPDATE 1

----------------------------Session #2-----------------------------------
UPDATE pizzeria SET rating = 3 WHERE id = 1;
-- ОШИБКА:  обнаружена взаимоблокировка
-- DETAIL:  Процесс 8820 ожидает в режиме ShareLock блокировку "транзакция 957"; заблокирован процессом 4760.
-- Процесс 4760 ожидает в режиме ShareLock блокировку "транзакция 958"; заблокирован процессом 8820.
-- HINT:  Подробности запроса смотрите в протоколе сервера.
-- CONTEXT:  при изменении кортежа (0,12) в отношении "pizzeria"

----------------------------Session #1-----------------------------------
COMMIT;
-- COMMIT

----------------------------Session #2-----------------------------------
COMMIT;
-- ROLLBACK